using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HowManyStickers
{
    internal class Program
    {

        // Pseudocode
        // Принять строку от пользователя
            // Перебрать её и найти числа.
            // Если числа идут подряд то склеить их и преобразовать в число с плавающей точкой.
            // Если это точка или запятая то считать дальнейшие числа идущие подряд дробной частью числа.
            // Записать полученные числа в переменную
        // Прибавить по 2 мм к кадлому числу.
        // Посчитать сколько раз отрезок поместится на стороне рабочего поля1 и 2.
        // Посчитать два варианта и сказать в каком варианте больше разместится прямоугольников.
        // return result;
        static void Main(string[] args)
        {
        }
    }
}
